# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "oven-sh/bun"
tap "stripe/stripe-cli"

# Core CLI
brew "bash"
brew "coreutils"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "jq"
brew "yq"
brew "tree"
brew "wget"
brew "htop"
brew "gnu-sed"
brew "watch"
brew "z"

# Git
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "lazygit"
brew "pre-commit"

# Dev languages & runtimes
brew "mise"
brew "go"
brew "rustup"
brew "deno"
brew "node"
brew "pnpm"
brew "oven-sh/bun/bun"

# Editors & terminal
brew "neovim"
brew "tmux", args: ["HEAD"]
brew "tree-sitter"

# Docker
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "colima", restart_service: :changed

# Cloud
brew "stripe/stripe-cli/stripe"
brew "doctl"

# Data
brew "postgresql"

# AI
brew "llm"
brew "codex"

# Misc CLI
brew "gnupg"
brew "gum"
brew "lsd"
brew "nmap"
brew "pandoc"
brew "typos-cli"

# Casks
cask "1password"
cask "1password-cli"
cask "claude"
cask "claude-code"
cask "ghostty"
cask "hammerspoon"
cask "hiddenbar"
cask "karabiner-elements"
cask "linear-linear"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "tailscale"
cask "whatsapp"
cask "zoom"
cask "cursor"
cask "discord"
cask "dropbox"
cask "figma"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-monaspace"

# VS Code extensions
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "vscodevim.vim"
vscode "unifiedjs.vscode-mdx"
vscode "vercel.turbo-vsc"

# npm globals
npm "@anthropic-ai/claude-code"
npm "vercel"
npm "wrangler"
npm "turbo"
npm "neonctl"
npm "firebase-tools"
npm "serve"
