tap "aesadde/local"
tap "argoproj/tap"
tap "bufbuild/buf"
tap "clojure/tools"
tap "cloudflare/cloudflare"
tap "eqnxio/ngrok"
tap "federico-terzi/espanso"
tap "github/gh"
tap "go-swagger/go-swagger"
tap "golangci/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "morantron/tmux-fingers"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "rs/tap"
tap "steipete/tap"
tap "stripe/stripe-cli"
tap "supabase/tap"
tap "tobi/try", "https://github.com/tobi/try"
tap "yakitrak/yakitrak"
brew "act"
brew "openssl@3"
brew "libuv"
brew "xz"
brew "node"
brew "agent-browser"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "argocd"
brew "ast-grep"
brew "automake"
brew "bash"
brew "blueutil"
brew "pcre2"
brew "glib"
brew "cairo"
brew "carthage"
brew "cmake"
brew "cmatrix"
brew "ripgrep"
brew "codex"
brew "lima"
brew "colima", restart_service: :changed
brew "coreutils"
brew "ctags"
brew "dav1d"
brew "deno"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "doctl"
brew "fd"
brew "libevent"
brew "libtasn1"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "libssh"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "python@3.13"
brew "fonttools"
brew "unixodbc"
brew "freetds"
brew "fzf"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "libgcrypt"
brew "libusb"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gping"
brew "openjdk"
brew "gradle"
brew "jasper"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "gum"
brew "haskell-stack"
brew "helm"
brew "htop"
brew "httpie"
brew "httrack"
brew "hugo"
brew "oniguruma"
brew "jq"
brew "k9s"
brew "kompose"
brew "krakend"
brew "kubernetes-cli"
brew "kubectx"
brew "kubeseal"
brew "kustomize"
brew "lazygit"
brew "libfido2"
brew "libslirp"
brew "libvterm"
brew "linkerd"
brew "llm"
brew "llmfit"
brew "lsd"
brew "lua"
brew "luarocks"
brew "mercurial"
brew "mise"
brew "mockery"
brew "mole"
brew "zlib"
brew "mysql"
brew "neovim"
brew "nginx"
brew "ninja"
brew "nmap"
brew "nnn"
brew "nspr"
brew "nss"
brew "nvm"
brew "openapi-generator"
brew "openjdk@17"
brew "pandoc"
brew "pillow"
brew "pnpm"
brew "poppler"
brew "postgresql@15", link: true
brew "postgresql@17"
brew "pre-commit"
brew "protobuf"
brew "pulumi"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "qemu"
brew "qt"
brew "ripgrep-all"
brew "rustup"
brew "shfmt"
brew "sox"
brew "step"
brew "stern"
brew "swig"
brew "tcl-tk"
brew "tctl"
brew "tmux", args: ["HEAD"]
brew "tree"
brew "tree-sitter"
brew "typos-cli"
brew "virtualenv"
brew "watch"
brew "weasyprint"
brew "wget"
brew "xmlstarlet"
brew "yarn"
brew "yq"
brew "yt-dlp"
brew "z"
brew "zellij"
brew "zsh-syntax-highlighting"
brew "bufbuild/buf/buf"
brew "clojure/tools/clojure"
brew "go-swagger/go-swagger/go-swagger"
brew "hashicorp/tap/terraform"
brew "morantron/tmux-fingers/tmux-fingers"
brew "oven-sh/bun/bun"
brew "rs/tap/curlie"
brew "steipete/tap/bird"
brew "steipete/tap/gogcli"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
brew "yakitrak/yakitrak/obsidian-cli"
cask "1password-cli"
cask "basictex"
cask "chromedriver"
cask "claude-code"
cask "steipete/tap/codexbar"
cask "darktable"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "ghostty"
cask "hammerspoon"
cask "hiddenbar"
cask "karabiner-elements"
cask "ngrok"
cask "qlmarkdown"
cask "raycast"
cask "rectangle"
cask "responsively"
cask "temurin"
cask "warp"
vscode "aaron-bond.better-comments"
vscode "anan.jetbrains-darcula-theme"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.pyright"
vscode "anysphere.remote-ssh"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "brennondenny.vsc-jetbrains-icons-enhanced"
vscode "bufbuild.vscode-buf"
vscode "dbaeumer.vscode-eslint"
vscode "dominicvonk.parameter-hints"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "ecmel.vscode-html-css"
vscode "eenaree.webstorm-new-dark"
vscode "eg2.vscode-npm-script"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "haydenbleasel.vercel-vscode"
vscode "highagency.pencildev"
vscode "kamikillerto.vscode-colorize"
vscode "keesschollaart.vscode-home-assistant"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "meouwu.css-var-color-decorator"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "postman.postman-for-vscode"
vscode "ria.elastic"
vscode "rokoroku.vscode-theme-darcula"
vscode "tht13.python"
vscode "tonka3000.raycast"
vscode "unifiedjs.vscode-mdx"
vscode "vercel.turbo-vsc"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
go "github.com/mvanhorn/printing-press-library/library/marketing/ahrefs/cmd/ahrefs-pp-cli"
go "github.com/bufbuild/buf/cmd/buf"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/ramya-rao-a/go-outline"
go "github.com/johnpili/go-text-to-image"
go "github.com/axw/gocov/gocov"
go "github.com/matm/gocov-html"
go "github.com/AlekSi/gocov-xml"
go "golang.org/x/tools/cmd/godoc"
go "golang.org/x/tools/gopls"
go "github.com/fullstorydev/grpcurl/cmd/grpcurl"
go "gitlab.com/akordacorp/insights-client/cmd/insights-client"
go "github.com/vektra/mockery/v2"
go "github.com/deepmap/oapi-codegen/cmd/oapi-codegen"
go "github.com/mvanhorn/cli-printing-press/v4/cmd/printing-press"
go "github.com/bufbuild/connect-go/cmd/protoc-gen-connect-go"
go "github.com/pseudomuto/protoc-gen-doc/cmd/protoc-gen-doc"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-grpc-gateway"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-openapiv2"
go "github.com/envoyproxy/protoc-gen-validate"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/supervisible/supervisible-cli/cmd/supervisible"
go "github.com/swaggo/swag/cmd/swag"
go "github.com/temporalio/temporalite/cmd/temporalite"
npm "@anthropic-ai/claude-code"
npm "@apidevtools/swagger-cli"
npm "@executeautomation/playwright-mcp-server"
npm "@githubnext/github-copilot-cli"
npm "@tailwindcss/cli"
npm "@webflow/webflow-cli"
npm "clawdbot"
npm "cordova-res"
npm "cursor-tools"
npm "firebase-tools"
npm "gulp-cli"
npm "linear-cli"
npm "miniflare"
npm "neonctl"
npm "npm-check"
npm "playwright"
npm "sanity"
npm "serve"
npm "ts-node"
npm "turbo"
npm "vercel"
npm "wrangler"
npm "zoho-extension-toolkit"
