tap "adoptopenjdk/openjdk"
tap "argoproj/tap"
tap "bufbuild/buf"
tap "caskroom/versions"
tap "clojure/tools"
tap "eqnxio/ngrok"
tap "federico-terzi/espanso"
tap "github/gh"
tap "go-swagger/go-swagger"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "rs/tap"
brew "argocd"
brew "automake"
brew "bash"
brew "readline"
brew "python@3.9"
brew "glib"
brew "carthage"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "ctags"
brew "dav1d"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "libevent"
brew "libtasn1"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gobject-introspection"
brew "libtiff"
brew "webp"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "gh"
brew "gnu-sed"
brew "libgcrypt"
brew "libusb"
brew "gnupg"
brew "go"
brew "gping"
brew "openjdk"
brew "gradle"
brew "jasper"
brew "netpbm"
brew "pango"
brew "graphviz"
brew "haskell-stack"
brew "helm"
brew "htop"
brew "httpie"
brew "hugo"
brew "hyperkit"
brew "oniguruma"
brew "jq"
brew "k9s"
brew "kompose"
brew "kubernetes-cli"
brew "kubectx"
brew "kubeseal"
brew "kustomize"
brew "libuv"
brew "libvterm"
brew "lsd"
brew "lua"
brew "luarocks"
brew "minikube"
brew "mockery"
brew "protobuf"
brew "mysql"
brew "neovim"
brew "ninja"
brew "nmap"
brew "nnn"
brew "node", link: false
brew "nspr"
brew "nss"
brew "openjdk@11"
brew "pandoc"
brew "pcre2"
brew "poppler"
brew "pulumi"
brew "python@3.8"
brew "qt"
brew "ripgrep"
brew "ripgrep-all"
brew "step"
brew "stern"
brew "swig"
brew "tctl"
brew "terraform"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "xmlstarlet"
brew "yarn"
brew "yq"
brew "z"
brew "zsh-syntax-highlighting"
brew "clojure/tools/clojure"
brew "eqnxio/ngrok/ngrok"
brew "federico-terzi/espanso/espanso"
brew "go-swagger/go-swagger/go-swagger"
brew "golangci/tap/golangci-lint"
brew "rs/tap/curlie"
cask "adoptopenjdk"
cask "adoptopenjdk11"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "hammerspoon"
cask "java11"
cask "karabiner-elements"
cask "qlmarkdown"
cask "rectangle"
