bash-completion
bibclean
caskroom/cask/brew-cask
cloc
coreutils
cscope
ctags
git
gnupg
gnuplot
graphicsmagick
gtk+3
haskell-stack
imagemagick
lua
luajit
maven
mercurial
rogual/neovim-dot-app/neovim-dot-app
nmap
pandoc-citeproc
python
python3
qt
reattach-to-user-namespace
redpen
sbt
scala
the_silver_searcher
tmux
wget
wine
xdot
z3
zeromq
zsh
